Core/src/Documents/НачислениеЗарплаты/НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеЗарплаты</name>
  <registerRecords>AccumulationRegister.РасчетыНДФЛ</registerRecords>
  <registerRecords>AccumulationRegister.СтраховыеВзносыДоходы</registerRecords>
  <registerRecords>AccumulationRegister.ПримененныеВычетыПоНДФЛ</registerRecords>
  <registerRecords>AccumulationRegister.НалоговыеЛготы</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоУдержаниям</registerRecords>
  <registerRecords>AccumulationRegister.НДФЛДоходы</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccumulationRegister.Декларация</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоНалогам</registerRecords>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПенсионнымФондом</registerRecords>
  <registerRecords>AccumulationRegister.НачисленияИУдержания</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПерсоналом</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСФондамиПоСтраховымВзносам</registerRecords>
  <registerRecords>AccumulationRegister.НДФЛРасчетыНалоговыхАгентовСБюджетом</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоКредитамИЗаймам</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПФ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДФЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НачисленияУдержания</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидНачисленияУдержания</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтработаноДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтработаноЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатрат</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>РучнаяКорректировка</name>
      <comment>Ручная корректировка</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление1</name>
      <type>
        <types>CatalogRef.ПараметрыРасчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление2</name>
      <type>
        <types>CatalogRef.ПараметрыРасчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель3</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление3</name>
      <type>
        <types>CatalogRef.ПараметрыРасчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипСчета</name>
      <comment>Реквизит управления условным оформлением</comment>
      <type>
        <types>EnumRef.ТипыСчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатратРегл</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидУдержанияПФ</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПФ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НалогиНаДоходы</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидНачисленияУдержания</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЛгот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПогашениеЗаймов</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорЗаймаСотруднику</name>
      <type>
        <types>DocumentRef.ДоговорКредитаИЗайма</types>
      </type>
    </attributes>
    <attributes>
      <name>ПогашеноЗайма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачисленоПроцентов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПогашеноПроцентов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидУдержанияНДФЛ</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидУдержанияПФ</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДФЛПогашеноЗайма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДФЛПогашеноПроцентов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПФПогашеноЗайма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПФПогашеноПроцентов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЛгот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЛготПроцента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Взносы</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидНачисленияУдержания</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатрат</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипСчета</name>
      <comment>Реквизит управления условным оформлением</comment>
      <type>
        <types>EnumRef.ТипыСчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатратРегл</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПримененныеВычетыПоНДФЛ</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>КодВычета</name>
      <type>
        <types>CatalogRef.ВычетыНДФЛ</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВычета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Удержания</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидУдержания</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидУдержанияНДФЛ</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДФЛ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидУдержанияПФ</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПФ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЛгот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Documents/НачислениеЗарплаты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Перем ИспользоватьТолькоРегламентированногоПланаСчетов Экспорт; //+++ Дмгг
#Область ПрограммныйИнтерфейс

// Функция рассчитывает сумму документа.
//
Функция ПолучитьСуммуДокумента() Экспорт

	СуммаНачислено	= НачисленияУдержания.Итог("Сумма");
	СуммаНДФЛ		= НалогиНаДоходы.Итог("Сумма");	
	СуммаПФ			= НачисленияУдержания.Итог("СуммаПФ");
	Для Каждого СтрокаЧН ИЗ НачисленияУдержания Цикл
		Если СтрокаЧН.ВидНачисленияУдержания.Тип = Перечисления.ТипыНачисленийИУдержаний.Удержание Тогда
			СуммаНачислено	= СуммаНачислено - СтрокаЧН.Сумма;
			СуммаПФ			= СуммаПФ		 - СтрокаЧН.СуммаПФ;
		КонецЕсли;
	КонецЦикла;
	
	СуммаПогашено	= ПогашениеЗаймов.Итог("ПогашеноЗайма") + ПогашениеЗаймов.Итог("ПогашеноПроцентов");
	СуммаУдержано	= СуммаНДФЛ + СуммаПФ + Удержания.Итог("Сумма") + СуммаПогашено;
	СуммаДокумента	= СуммаНачислено - СуммаУдержано;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("СуммаНачислено",	СуммаНачислено);
	СтруктураВозврата.Вставить("СуммаУдержано",		СуммаУдержано);
	СтруктураВозврата.Вставить("СуммаДокумента",	СуммаДокумента);
	СтруктураВозврата.Вставить("СуммаПогашено",		СуммаПогашено);
	СтруктураВозврата.Вставить("СуммаВзносов",		Взносы.Итог("Сумма"));
	СтруктураВозврата.Вставить("СуммаПФ",			СуммаПФ);
	СтруктураВозврата.Вставить("СуммаНДФЛ",			СуммаНДФЛ);
	
	Возврат СтруктураВозврата;
	
	//ТаблицаНачислений = Новый ТаблицаЗначений;
	//Массив = Новый Массив;
	//СтруктураВозврата = Новый Структура("СуммаНачислено, СуммаУдержано, СуммаДокумента, СуммаПогашено, СуммаВзносов", 0, 0, 0, 0, 0);
	//
	//СтруктураВозврата.СуммаВзносов = Взносы.Итог("Сумма");
	//Массив.Добавить(Тип("СправочникСсылка.ВидыНачисленийИУдержаний"));
	//ОписаниеТипов = Новый ОписаниеТипов(Массив, ,);
	//Массив.Очистить();
	//ТаблицаНачислений.Колонки.Добавить("ВидНачисленияУдержания", ОписаниеТипов);

	//Массив.Добавить(Тип("Число"));
	//ОписаниеТипов = Новый ОписаниеТипов(Массив, ,);
	//Массив.Очистить();
	//ТаблицаНачислений.Колонки.Добавить("Сумма", ОписаниеТипов);
	//
	//Для каждого СтрокаТЧ Из НачисленияУдержания Цикл
	//	НоваяСтрока = ТаблицаНачислений.Добавить();
	//    НоваяСтрока.ВидНачисленияУдержания = СтрокаТЧ.ВидНачисленияУдержания;
	//    НоваяСтрока.Сумма = СтрокаТЧ.Сумма;
	//КонецЦикла;
	//Для каждого СтрокаТЧ Из НалогиНаДоходы Цикл
	//	НоваяСтрока = ТаблицаНачислений.Добавить();
	//    НоваяСтрока.ВидНачисленияУдержания = СтрокаТЧ.ВидНачисленияУдержания;
	//    НоваяСтрока.Сумма = СтрокаТЧ.Сумма;
	//КонецЦикла;
	//
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//                      |	ТаблицаНачисленияУдержания.ВидНачисленияУдержания,
	//                      |	ТаблицаНачисленияУдержания.Сумма
	//                      |ПОМЕСТИТЬ ТаблицаНачисленияУдержания
	//                      |ИЗ
	//                      |	&ТаблицаНачисленияУдержания КАК ТаблицаНачисленияУдержания
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	СУММА(ВЫБОР
	//                      |			КОГДА НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	//                      |				ТОГДА НачислениеЗарплатыНачисленияУдержания.Сумма
	//                      |			ИНАЧЕ 0
	//                      |		КОНЕЦ) КАК СуммаНачислено,
	//                      |	СУММА(ВЫБОР
	//                      |			КОГДА НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	//                      |				ТОГДА 0
	//                      |			ИНАЧЕ НачислениеЗарплатыНачисленияУдержания.Сумма
	//                      |		КОНЕЦ) КАК СуммаУдержано,
	//                      |	СУММА(ВЫБОР
	//                      |			КОГДА НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	//                      |				ТОГДА НачислениеЗарплатыНачисленияУдержания.Сумма
	//                      |			ИНАЧЕ -1 * НачислениеЗарплатыНачисленияУдержания.Сумма
	//                      |		КОНЕЦ) КАК СуммаДокумента
	//                      |ИЗ
	//                      |	ТаблицаНачисленияУдержания КАК НачислениеЗарплатыНачисленияУдержания");
	//					  
	//Запрос.УстановитьПараметр("ТаблицаНачисленияУдержания", ТаблицаНачислений);
	//РезультатЗапроса = Запрос.ВыполнитьПакет();
	//
	//СтруктураВозврата.Вставить("СуммаПогашено", ПогашениеЗаймов.Итог("ПогашеноЗайма") + ПогашениеЗаймов.Итог("ПогашеноПроцентов"));
	//
	//Если РезультатЗапроса[1].Пустой() Тогда
	//	СтруктураВозврата.СуммаДокумента = СтруктураВозврата.СуммаДокумента - СтруктураВозврата.СуммаПогашено;
	//	Возврат СтруктураВозврата;	
	//Иначе
	//	ЗаполнитьЗначенияСвойств(СтруктураВозврата, РезультатЗапроса[1].Выгрузить()[0]);
	//	Если ЗначениеЗаполнено(СтруктураВозврата.СуммаДокумента) Тогда
	//		СтруктураВозврата.СуммаДокумента = СтруктураВозврата.СуммаДокумента - СтруктураВозврата.СуммаПогашено;
	//	Иначе
	//		СтруктураВозврата.СуммаДокумента = -СтруктураВозврата.СуммаПогашено;
	//	КонецЕсли;
	//	Возврат СтруктураВозврата;	
	//КонецЕсли; 

КонецФункции // ПолучитьСуммуДокумента()

#КонецОбласти

#Область ОбработчикиСобытий

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СтруктураСумм  = ПолучитьСуммуДокумента();
	СуммаДокумента	= СтруктураСумм.СуммаДокумента;
	СуммаНДФЛ		= СтруктураСумм.СуммаНДФЛ;
	СуммаПФ			= СтруктураСумм.СуммаПФ;
	
	Если НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимНаправлениямДеятельности.Получить() Тогда
		
		Для каждого СтрокаНачисленияУдержания из НачисленияУдержания Цикл
			
			Если НЕ ИспользоватьТолькоРегламентированногоПланаСчетов Тогда //+++ Дмгг
				
				Если СтрокаНачисленияУдержания.СчетЗатрат.ТипСчета = Перечисления.ТипыСчетов.Расходы Тогда
					
					СтрокаНачисленияУдержания.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ОсновноеНаправление;
					
				КонецЕсли;	
			//+++ Дмгг	
			Иначе
				
				Если СтрокаНачисленияУдержания.СчетЗатрат.ТипСчета = Перечисления.ТипыСчетов.Расходы Тогда
					
					СтрокаНачисленияУдержания.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ОсновноеНаправление;
					
				КонецЕсли;
				
			КонецЕсли;
			//--- Дмгг
		КонецЦикла;	
		
		Для каждого СтрокаВзносы из Взносы Цикл
			
			Если НЕ ИспользоватьТолькоРегламентированногоПланаСчетов Тогда //+++ Дмгг
				
				Если СтрокаВзносы.СчетЗатрат.ТипСчета = Перечисления.ТипыСчетов.Расходы Тогда
					
					СтрокаВзносы.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ОсновноеНаправление;
					
				КонецЕсли;	
			//+++ Дмгг	
			Иначе
				
				Если СтрокаНачисленияУдержания.СчетЗатрат.ТипСчета = Перечисления.ТипыСчетов.Расходы Тогда
					
					СтрокаНачисленияУдержания.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ОсновноеНаправление;
					
				КонецЕсли;
				
			КонецЕсли;
			//--- Дмгг
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры // ПередЗаписью()

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Для начисления страховых взносов запишем изначально доходы по страховым взносам
	Сотрудники.ОтразитьСтраховыеВзносыДоходы(Ссылка, ДополнительныеСвойства, Движения, Отказ);
	
	// Инициализация данных документа.
	Документы.НачислениеЗарплаты.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	УправлениеНебольшойФирмойСервер.ОтразитьНачисленияИУдержания(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыСПерсоналом(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыПоНалогам(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыНДФЛ(ДополнительныеСвойства, Движения, Отказ);
	//УправлениеНебольшойФирмойСервер.ОтразитьУправленческий(ДополнительныеСвойства, Движения, Отказ);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьХозрасчетный(ДополнительныеСвойства, Движения, Отказ);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьРасчетыСПенсионнымФондом(ДополнительныеСвойства, Движения, Отказ);//Паганини ПФ
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьДекларация(ДополнительныеСвойства, Движения, Отказ);
	//Паганини#Удержания_
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыСПоставщиками(ДополнительныеСвойства, Движения, Отказ);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьРасчетыПоУдержаниям(ДополнительныеСвойства, Движения, Отказ);
	//_Паганини#Удержания
	
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыСПоставщиками(ДополнительныеСвойства, Движения, Отказ);

	//ДД
	УправлениеНебольшойФирмойСервер.ОтразитьНалоговыеЛготы(ДополнительныеСвойства, Движения, Отказ);
	
	// Учет расчетов по займам сотрудникам.
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыПоКредитамИЗаймам(ДополнительныеСвойства, Движения, Отказ);
	//Сотрудники.ОтразитьПримененныеВычетыПоНДФЛ(ДополнительныеСвойства, Движения, Отказ);
	//Сотрудники.ОтразитьНДФЛДоходы(ДополнительныеСвойства, Движения, Отказ); ////НДФЛД OFF
	//Сотрудники.ОтразитьСтраховыеВзносыДоходы(Ссылка, ДополнительныеСвойства, Движения, Отказ);
	//Сотрудники.ОтразитьРасчетыСФондамиПоСтраховымВзносам(ДополнительныеСвойства, Движения, Отказ);
	//Сотрудники.ОтразитьНДФЛРасчетыНалоговыхАгентовСБюджетом(ДополнительныеСвойства, Движения, Отказ);   ////НДФЛД OFF
	
	// Запись наборов записей.
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	// Контроль
	Документы.НачислениеЗарплаты.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры // ОбработкаПроведения()

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для удаления проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей.
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль
	Документы.НачислениеЗарплаты.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ, Истина);
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты) //+++ Дмгг
	
	ИспользоватьТолькоРегламентированногоПланаСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(Дата);
	Если ИспользоватьТолькоРегламентированногоПланаСчетов Тогда 
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "НачисленияУдержания.СчетЗатрат");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Взносы.СчетЗатрат");
		ПроверяемыеРеквизиты.Добавить("НачисленияУдержания.СчетЗатратРегл");
		ПроверяемыеРеквизиты.Добавить("Взносы.СчетЗатратРегл");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
ИспользоватьТолькоРегламентированногоПланаСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(Дата),Дата,ТекущаяДата())); //+++ Дмгг
#КонецЕсли
